html/articles/templates.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-04 di 13:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Templates</title>
<meta name="author" content="Tobin Stultiens" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Templates</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfd2261d">1. Templates</a>
<ul>
<li><a href="#orge0bc862">1.1. Stir Fry&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Template">Template</span>&#xa0;<span class="Wok">Wok</span></span></a></li>
<li><a href="#org145c708">1.2. Burritos&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Beef">Beef</span>&#xa0;<span class="Template">Template</span>&#xa0;<span class="Mexican">Mexican</span></span></a></li>
<li><a href="#org39923cc">1.3. Quesedillas&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Vegan">Vegan</span>&#xa0;<span class="Mexican">Mexican</span>&#xa0;<span class="Cheese">Cheese</span></span></a></li>
<li><a href="#orgbcd3842">1.4. How to pimp my noodles&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Noodles">Noodles</span></span></a></li>
<li><a href="#org2c0ed5e">1.5. Rice&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Rice">Rice</span></span></a>
<ul>
<li><a href="#orgc819060">1.5.1. Spice Up your rice</a></li>
</ul>
</li>
<li><a href="#org439174a">1.6. Ramen</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgfd2261d" class="outline-2">
<h2 id="orgfd2261d"><span class="section-number-2">1.</span> Templates</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge0bc862" class="outline-3">
<h3 id="orge0bc862"><span class="section-number-3">1.1.</span> Stir Fry&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Template">Template</span>&#xa0;<span class="Wok">Wok</span></span></h3>
<div class="outline-text-3" id="text-1-1">
<p>
This is a stir fry template here I describe the required parts of a stir fry and the optional parts.
</p>

<p>
Required:
</p>
<ul class="org-ul">
<li>Garlic</li>
<li>Ginger</li>
</ul>

<p>
Optional:
Vegetable:
</p>
<ul class="org-ul">
<li>Mushrooms</li>
<li>Onion</li>
<li>Red pepper</li>
<li>Spring onion</li>
<li>Peppers</li>
</ul>

<p>
Meat:
</p>
<ul class="org-ul">
<li>Chicken</li>
<li>Pork</li>
<li>Beef</li>
</ul>

<p>
Sauces:
</p>
<ul class="org-ul">
<li>Teriyaki Sauce</li>
<li>Soy based sauce</li>
</ul>
</div>
</div>

<div id="outline-container-org145c708" class="outline-3">
<h3 id="org145c708"><span class="section-number-3">1.2.</span> Burritos&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Beef">Beef</span>&#xa0;<span class="Template">Template</span>&#xa0;<span class="Mexican">Mexican</span></span></h3>
<div class="outline-text-3" id="text-1-2">
<p>
ESSENTIAL INGREDIENTS 
</p>
<ul class="org-ul">
<li>Rundergehakt 700-800 gram </li>
<li>Mais </li>
<li>Paprika </li>
<li>Onions </li>
<li>Wrap </li>
<li>Cheese </li>
<li>Creme fraiche </li>
</ul>
<p>
 
POSSIBLE INGREDIENTS 
</p>
<ul class="org-ul">
<li>Chili Pepers </li>
<li>Knoflook </li>
<li>Tomaat </li>
<li>Champignons </li>
<li>Sla </li>
</ul>
<p>
 
Spices: 
</p>
<ul class="org-ul">
<li>Taco</li>
</ul>
</div>
</div>

<div id="outline-container-org39923cc" class="outline-3">
<h3 id="org39923cc"><span class="section-number-3">1.3.</span> Quesedillas&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Vegan">Vegan</span>&#xa0;<span class="Mexican">Mexican</span>&#xa0;<span class="Cheese">Cheese</span></span></h3>
<div class="outline-text-3" id="text-1-3">
<p>
Ingredients: 
</p>
<ul class="org-ul">
<li>Wraps </li>
<li>Cheese </li>
<li>Olive oil or Butter</li>
</ul>
<p>
 
Optional: 
</p>
<ul class="org-ul">
<li>Bacon stukjes </li>
<li>Avocado </li>
<li>Sla </li>
<li>Lente uien </li>
<li>Tomatoes Diced </li>
<li>Prosciutto  </li>
<li>Thinly sliced chorizo</li>
</ul>
</div>
</div>

<div id="outline-container-orgbcd3842" class="outline-3">
<h3 id="orgbcd3842"><span class="section-number-3">1.4.</span> How to pimp my noodles&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Noodles">Noodles</span></span></h3>
<div class="outline-text-3" id="text-1-4">
<p>
This is a simple guide on how to pimp your instant <a href="https://www.budgetbytes.com/6-ways-to-upgrade-instant-ramen/">noodles</a>.
</p>

<p>
Ingredients:
</p>
<ul class="org-ul">
<li>Vegetables</li>
<li>1 clove Garlic</li>
<li>1/2 tsp grated ginger</li>
<li>250 ml broth</li>
<li>250 ml water</li>
<li>1 package instant ramen</li>
<li>1 egg</li>
<li>1 green onion</li>
</ul>

<p>
Steps:
</p>
<ol class="org-ol">
<li>Add the oil, garlic, and ginger to a small sauce pot and sauté over medium for about one minute.</li>
<li>Add your vegetable of choice and saute for about a minute.</li>
<li>Add the broth and water, and bring to a boil.</li>
<li>Now make your broth your own add sauces to the broth and taste whether this is what you like. My personal favorite thing to add is sriracha and chicken bouillon as broth.</li>
<li>Crack the egg into the broth for about a minute, then add your instant noodles for 3 minutes.</li>
<li>Transfer the soup to a bowl, then top it with sliced green onion.</li>
</ol>
</div>
</div>

<div id="outline-container-org2c0ed5e" class="outline-3">
<h3 id="org2c0ed5e"><span class="section-number-3">1.5.</span> Rice&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Rice">Rice</span></span></h3>
<div class="outline-text-3" id="text-1-5">
<p>
This is the formula for how to make rice.
The only requirement is that you wash your rice before following this.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Rice</th>
<th scope="col" class="org-left">Water</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Sushi Rice</td>
<td class="org-left">1 + 1/3</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Normal Rice</td>
<td class="org-left">1 + 1/2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Basmati Rice</td>
<td class="org-left">1 + 2</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-orgc819060" class="outline-4">
<h4 id="orgc819060"><span class="section-number-4">1.5.1.</span> Spice Up your rice</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
What is nice to do with basmati rice is adding whole seeds to them.
How you do this is by doing the following:
</p>
<ol class="org-ol">
<li>Wash your rice but don&rsquo;t soak it.</li>
<li>Prepare a pan add butter in it add your whole seeds and some salt.</li>
<li>Let the seeds fizzle for a while.</li>
<li>Add your rice and fry them on low heat for 30 seconds.</li>
<li>Add water and let it cook on the lowest heat for 10 minutes.</li>
<li>Last of all let it steam for 5 minutes.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org439174a" class="outline-3">
<h3 id="org439174a"><span class="section-number-3">1.6.</span> Ramen</h3>
<div class="outline-text-3" id="text-1-6">
<p>
I would recommend looking into this book <a href="./pdf/The Ramen_Lord Book of Ramen.pdf">The Ramen Lord Book of Ramen</a>
Also <a href="https://www.ethanchlebowski.com/cooking-techniques-recipes/chicken-shoyu-ramen">this</a> has some interesting ideas.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tobin Stultiens</p>
<p class="date">Created: 2022-01-04 di 13:22</p>
</div>
</body>
</html>
